let arrayOfQuestions = [
    "ألوم نفسي علي مواقف يراها الآخرون لا تستحق اللوم",
    "من الصعب أن أجد في من حولي من يؤدي ما أطالب نفسي به",
    "عندما ألاحظ عيباً صغيراً في شخصيتي أفكر في كل عيوبي الأخري",
    "أكون مطمئن عندما تسير الأمور علي ما يرام ولكن أضطرب بشدة لمجرد اتكابي خطأ ما و لو صغير",
    "يري من حولي أني أطالب نفسي بكثير من الأمور و أتوقع منها الكثير",
    "عندما يتعطل أو يتدهور أمر ما، ألوم نفسي و أشعر أني لن أنجح في شئ أبداً",
    "لا يرضيني ما هو أقل مما توقعته من نفسي و خططت له",
    "أسعي لتحقيق أهدافي بمنتهي الدقة و الترتيب",
    "يقل تقديري لنفسي مع أي غلطة أرتكبها حتي لو صغيرة",
    "أشعر بالاستياء من نفسي عندما لا أحقق ما توقعته مني",
    "أخطط لنفسي بأهداف و معايير أعلي بكثير من تلك التي يُخطط بها غير لأنفسهم",
    "عند شعوري بالقلق و الحزن، يصبح ما يحترمه الآخرين في لا قيمة له عندي",
    "أصاب بالإحباط الشديد عندما لا أحقق الأداء الذي توقعته لنفسي",
    "أسعي دوماً للكمالية و الإتقان في كل ما أقوم به",
    "مشاعري تتقلب بسرعة من الرضا عن نفسي إلي الشعور بالخيبة و الفشل",
    "أحاسب نفسي بقسوة حين يصدر مني أقل الأخطاء",
    "أحاسب نفسي بشكل أكبر مما يحاسب به غيري أنفسهم",
    "عند شعوري بالحزن لتدهور أمر ما يُصبح ما يحترمه الآخرون في لا قيمة له",
    "يستمر لومي لنفسي كلما تذكرت أخطائي السابقة مهما كانت صغيرة",
    "أطالب نفسي بأداء الكثير و أتوقع منها الأكثر",
    "أي خطأ يصدر مني و لو صغير يجعلني لا أري من نفسي إلا الأخطاء",
    "أقوم بتأنيب نفسي علي أي فعل خاطئ و لو تقبله الآخرين",
    "لا أرضي عن نفسي بتلك البساطة التي يرضي بها غير عن أنفسهم",
    "عندما ألحظ عيباً في شخصيتي يقل شعوري بالرضا عن نفسي",
    "أشعر بالتوتر و الضيق إن لم أحقق ما خططت له",
    "أسعي لتحقيق أهداف و مستويات يراها الآخرين مبالغ فيها",
    "إذا ما صدر مني خطأ فلا أري ما يراه الآخرون في من نجاح",
    "أحاسب نفسي بشدة علي أقل تقصير يصدر مني",
    "أتطلع دائماً لتحقيق ما يصعب علي غير تحقيقه",
    "إذا ما حدث لي موقف صعب أري أن كل ما هو أتي من المواقف أصعب"
];


function appending() {
    let j = 0;
    let k = 1;
    let l = 2;
    let o = 3;
    let q = 5;

    for (let i = 0; i < arrayOfQuestions.length; i++) {
        j = 0;
        j++;
        k = 1;
        k++;
        l = 2;
        l++;
        o = 3;
        o++;

        $(".container-fluid").append("<p class=" + "questions" + "> " + arrayOfQuestions[i] + " </p>" + radioButton("تنطبق دائماً", i, q) + radioButton("تنطبق كثيراً", i, o) + radioButton("تنطبق أحياناً", i, l) + radioButton("تنطبق نادراً", i, k) + radioButton("تنطبق أبداً", i, j));
    }

}


function radioButton(labelString, radioName, value) {
    let input = `<div class="radioBtn"><label>${labelString}</label><input type="radio" name = "${radioName}" value="${value}"></div>`;
    return input;
}


$("#result").fadeOut();

$("#button").click(function (e) {
    let allRadios = $('input[type="radio"]');
    let answerValues = [];
    let sum;
    for (let radioItem of allRadios) {
        let item = $(radioItem).attr("value");

        if (radioItem.checked) {
            answerValues.push(item);
        }
    }

    $("#result").html(`<p>${sum}</p>`);

    $(".questions-container").fadeOut();
    $("#button").fadeOut();
    $("#result").fadeIn();


});


/**
 * press the button 
 * select all the checked radio buttons in the page 
 * loop on them and get their values
 * put them in an array of object ex: [1,3,5]
 */


appending();
